[
    {
        "Movie Name": "The White Tiger",
        "Poster": "https://filmfare.wwmindia.com/content/2021/jan/white-tiger1611332997.jpg",
        "Genre": "Comedy, Drama",
        "Release Date": "16-Apr-21",
        "RunTime": "2 hours 5 minutes",
        "Director": "Devesh Sharma",
        "Cast": "Adarsh Gourav, Rajkummar Rao, Priyanka Chopra, Mahesh Manjrekar, Vijay Maurya",
        "IMDB": 8,
        "Rate": 4,
        "Review": "The White Tiger is an adaptation of Aravind Adiga's 2008 novel of the same name. The film deals with caste politics and showcases the rich-poor divide that exists in India. It offers a commentary on what’s wrong with our country, where even after so many years of democracy, the mighty still rule over those with lesser means. In the film’s somewhat lopsided worldview the only way up for the poor is through crime and politics. Director Ramin Bahrani has made the film for Western audiences. Hence, all we see is abject poverty at one hand and high-society lifestyle on the other. It’s as if the great Indian middle class, which is driving the world economy forward by its buying power, simply doesn’t exist. This division into the haves and have-nots is too simplistic indeed.On one end of the spectrum is Balram Halwai (Adash Gourav), who has studied a little as a child, knows how to speak Hindi, and his ambition is to become the driver of Ashok (Rajkummar Rao), the younger son of his village zamindar (Mahesh Manjrekar). Ashok, who has studied in America, is married to Pinky (Priyanka Chopra) an Indian girl born and raised in America. While the zamindar and his elder son (Vijay Maurya) treat Balram like he's only a rung above being an animal, the only people who treat him as a human being are America returned Ashok and Pinky. Pinky, in particular, is the sole humanitarian in the film. She constantly eggs him to rebel, to not take things lying down. Pinky is also guilty of running over a child while drunk driving. A crime which Balram is forced to take the blame for. Does it sound familiar to a well-known hit and run case in Mumbai? His inability to say no further propels him to break the invisible chains around him, leading to a night of crime, rebellion, but ultimately redemption for him."
    },
    {
        "Movie Name": "Tenet",
        "Poster": "https://filmfare.wwmindia.com/content/2020/dec/tenet21607339711.jpg",
        "Genre": "Fantasy, Sci-Fi",
        "Release Date": "12-Aug-20",
        "RunTime": "2 hours 30 minutes",
        "Director": "Christopher Nolan",
        "Cast": "John David Washington, Robert Pattinson, Dimple Kapadia, Elizabeth Debicki, Kenneth Branagh",
        "IMDB": 8.5,
        "Rate": 4,
        "Review": "It’s hugely ironic to say that Salman Khan’s iconic dialogue from Kick, “Mere baare mein itna mat sochna, main dil mein aata hoon samajh mein nahi,” could actually be applied to Christopher Nolan’s Tenet. Just enjoy watching a visual spectacle unfold, don’t try to understand it. Because, after a while, your brain kind of gives up on keeping track of things. So just enjoy the ride. Nolan has given us difficult to understand films before. Films like Memento (2000), Inception (2010), Interstellar (2014) have all increasingly boggled your mind. He has played around with memory, time and space travel, even the theory of relativity before but this one is more esoteric than his earlier efforts.The Protagonist (John David Washington) -- yes, the central character is called just that in the film -- participates in an undercover operation at a Kyiv opera house. The operation is shot to pieces and he gets captured. He later commits suicide by chewing on a cyanide tablet. But he’s not dead. The whole thing was a test of his loyalty it seems. He’s partnered with his handler and partner Neil (Robert Pattinson) to go undercover again on a more dangerous mission. It seems someone in future has perfected a technology which reverses the entropy of objects. For instance, a bullet fired can travel backwards in time -- don’t ask us to explain the science behind this, please. Somehow, the CIA has come to know about it and think it has the potential to end the world. They want to prevent it from falling in the wrong hands. The protagonist is first sent to India, where a Mumbai-based arms dealer, Priya (Dimple Kapadia) points him towards an even bigger fish, Russian arms dealer, Andrei Sator (Kenneth Branagh). Katherine \"Kat\" Barton (Elizabeth Debicki) is the estranged art dealer wife of Sator and she’s used as a peg to get to him. But things aren’t as upfront as they seem and the Protagonist really has to employ all his wits and trust in luck to get the job done."
    },
    {
        "Movie Name": "Peninsula",
        "Poster": "https://filmfare.wwmindia.com/content/2020/nov/peninsulapeninsulapeninsula11606480569.jpg",
        "Genre": "Horror",
        "Release Date": "27-Nov-20",
        "RunTime": "1 hours 56 minutes",
        "Director": "Yeon Sang-ho",
        "Cast": "Gang Dong-won, Lee Jung-hyun, Kim Do-yoon, Lee Re, Lee Ye-won",
        "IMDB": 7,
        "Rate": 3,
        "Review": "If Train To Busan told you what a virus outbreak looks like, its sequel, Peninsula, acquaints you with what happens when the outbreak takes the form of an epidemic. Given the present scenario, the movie seems strangely resonant. Though the coronavirus hasn’t exactly turned us into zombies. We’ve only reached the couch potato stage yet. Thank god. Right now, thanks to movement restrictions, and the lockdown scenario before that, we all experienced curbs on our freedom. Governments the world over seemed more authoritative. We collectively came to realise the importance of friendships, of family. Some countries started projecting themselves as a safe haven. Survival became paramount. All these real-life issues are brought forth in one form or other in this zombie drama. Political irony has been brought in as North Korea is declared a safe haven, while the Southern counterpart is transformed into a zombie infected wasteland. But the socio-political summary remains on the surface and lacks real bite. If Train To Busan told you what a virus outbreak looks like, its sequel, Peninsula, acquaints you with what happens when the outbreak takes the form of an epidemic. Given the present scenario, the movie seems strangely resonant. Though the coronavirus hasn’t exactly turned us into zombies. We’ve only reached the couch potato stage yet. Thank god. Right now, thanks to movement restrictions, and the lockdown scenario before that, we all experienced curbs on our freedom. Governments the world over seemed more authoritative. We collectively came to realise the importance of friendships, of family. Some countries started projecting themselves as a safe haven. Survival became paramount. All these real-life issues are brought forth in one form or other in this zombie drama. Political irony has been brought in as North Korea is declared a safe haven, while the Southern counterpart is transformed into a zombie infected wasteland. But the socio-political summary remains on the surface and lacks real bite."
    },
    {
        "Movie Name": "Fantasy Island",
        "Poster": "https://filmfare.wwmindia.com/content/2020/feb/fantasyisland11581592007.jpg",
        "Genre": "Thriller, Horror",
        "Release Date": "13-Feb-20",
        "RunTime": "1 hours 50 minutes",
        "Director": "Jeff Wadlow",
        "Cast": "Michael Peña, Maggie Q, Lucy Hale, Austin Stowell, Portia Doubleday, Jimmy O. Yang, Ryan Hansen, Michael Rooker",
        "IMDB": 6.5,
        "Rate": 3,
        "Review": "Fantasy Island reminds you of Jumanji. A group of strangers undergo rather fantastical series of events in order to stay alive. It also has shades of Agatha Christie's classic, And Then There Were None. Also of Lost. One should also bear in mind that it's the official adaptation of a popular American series from the '70s going by the same name. The series had a mysterious host inviting a set number of guests. Each guest underwent a personal fantasy, which invariably took a life of its own and imparted a life lesson to the participant as well as to the viewers. The tales were quirky, dark, twisted and were always true to the adage that you should be careful about what you wish for. Fantasy Island reminds you of Jumanji. A group of strangers undergo rather fantastical series of events in order to stay alive. It also has shades of Agatha Christie's classic, And Then There Were None. Also of Lost. One should also bear in mind that it's the official adaptation of a popular American series from the '70s going by the same name. The series had a mysterious host inviting a set number of guests. Each guest underwent a personal fantasy, which invariably took a life of its own and imparted a life lesson to the participant as well as to the viewers. The tales were quirky, dark, twisted and were always true to the adage that you should be careful about what you wish for."
    },
    {
        "Movie Name": "Birds of Prey",
        "Poster": "https://filmfare.wwmindia.com/content/2020/feb/birdsofprey11580905089.jpg",
        "Genre": "Action, Comedy",
        "Release Date": "6-Apr-20",
        "RunTime": "1 hours 49 minutes",
        "Director": "Cathy Yan",
        "Cast": "Margot Robbie, Mary Elizabeth Winstead, Jurnee Smollett-Bell, Rosie Perez, Chris Messina, Ella Jay Basco, Ali Wong, Ewan McGregor",
        "IMDB": 6.5,
        "Rate": 3,
        "Review": "The film starts with telling us that the Joker and Harley Quinn have broken up. After partying like mad for days in by Roman Sionis' (Ewan McGregor) club to get over her heartbreak, Harley, who is a trained psychiatrist, figures she needs to do something spectacular to get a proper closure for herself. So she blows up a chemical factory -- the very same place where she lost her heart to Joker, to announce her singleton status. This kind of paints a target on her back as the invisible protection that the Joker provided for her gets revoked. Everyone whom she has ever pissed off -- and that's like half of Gotham, now begins to go after her. But the most dangerous is Roman, who goes by the name Black Mask and has a fetish for cutting off people's faces. He's after a diamond stolen by Cassandra Cain (Ella Jay Basco). Harley takes the young thief under her wing and with the help of an unlikely set of comrades, Huntress (Mary Elizabeth Winstead), Black Canary (Jurnee Smollett-Bell), and Renee Montaya (Rosie Perez) making for a maverick team of female vigilantes collectively known as Birds of Prey.The film starts with telling us that the Joker and Harley Quinn have broken up. After partying like mad for days in by Roman Sionis' (Ewan McGregor) club to get over her heartbreak, Harley, who is a trained psychiatrist, figures she needs to do something spectacular to get a proper closure for herself. So she blows up a chemical factory -- the very same place where she lost her heart to Joker, to announce her singleton status. This kind of paints a target on her back as the invisible protection that the Joker provided for her gets revoked. Everyone whom she has ever pissed off -- and that's like half of Gotham, now begins to go after her. But the most dangerous is Roman, who goes by the name Black Mask and has a fetish for cutting off people's faces. He's after a diamond stolen by Cassandra Cain (Ella Jay Basco). Harley takes the young thief under her wing and with the help of an unlikely set of comrades, Huntress (Mary Elizabeth Winstead), Black Canary (Jurnee Smollett-Bell), and Renee Montaya (Rosie Perez) making for a maverick team of female vigilantes collectively known as Birds of Prey."
    },
    {
        "Movie Name": "Bad Boys for Life",
        "Poster": "https://filmfare.wwmindia.com/content/2020/jan/bad-boys-for-life-11580210415.jpg",
        "Genre": "Action",
        "Release Date": "7-Apr-20",
        "RunTime": "2 hours 5 minutes",
        "Director": "Adil El Arbi, Bilall Fallah",
        "Cast": "Will Smith, Martin Lawrence, Vanessa Hudgens, Jacob Scipio, Alexander Ludwig, Kate del Castillo, Joe Pantoliano, Charles Melton, Paola Núñez, Nicky Jam, DJ Khaled",
        "IMDB": 6,
        "Rate": 3,
        "Review": "Bad Boys For Life opens with a bang. Veteran cops Mike Lowrey (Will Smith) and Marcus Burnett (Martin Lawrence) are zooming at breakneck speed in Mike’s gleaming new Porsche. They are mouthing corny dialogue and seem to be chasing someone. Only we also see lots of police vehicles following them so we’re kind of confused. Well, it turns out they’re racing to a hospital as Marcus is going to be a grandfather. After the birth of his daughter’s child Marcus’ priorities sort of change. He’s tired of being a badass cop and wants to retire while Mike wants to continue their good cop-bad cop routine till the end of time. Things take a turn when Mike is gunned down by a masked gunman. Captain Howard (Joe Pantoliano) wants Rita (Paola Núñez), Mike’s ex-girlfriend to head the special task force assigned to deal with such threats. The new team makes little headway, however and after being discharged from the hospital, Mike wants to head the investigation himself. The killer keeps targeting other law enforcement officers and members of the judiciary and things come to a head when the captain too is gunned down. This forces a change of heart in Marcus who agrees to ride down with his partner one last time to take care of unfinished business.Bad Boys For Life opens with a bang. Veteran cops Mike Lowrey (Will Smith) and Marcus Burnett (Martin Lawrence) are zooming at breakneck speed in Mike’s gleaming new Porsche. They are mouthing corny dialogue and seem to be chasing someone. Only we also see lots of police vehicles following them so we’re kind of confused. Well, it turns out they’re racing to a hospital as Marcus is going to be a grandfather. After the birth of his daughter’s child Marcus’ priorities sort of change. He’s tired of being a badass cop and wants to retire while Mike wants to continue their good cop-bad cop routine till the end of time. Things take a turn when Mike is gunned down by a masked gunman. Captain Howard (Joe Pantoliano) wants Rita (Paola Núñez), Mike’s ex-girlfriend to head the special task force assigned to deal with such threats. The new team makes little headway, however and after being discharged from the hospital, Mike wants to head the investigation himself. The killer keeps targeting other law enforcement officers and members of the judiciary and things come to a head when the captain too is gunned down. This forces a change of heart in Marcus who agrees to ride down with his partner one last time to take care of unfinished business."
    },
    {
        "Movie Name": "Jojo Rabbit",
        "Poster": "https://filmfare.wwmindia.com/content/2020/jan/jojo-rabbit-11580200167.jpg",
        "Genre": "Comedy, Drama",
        "Release Date": "28-Jan-20",
        "RunTime": "1 hours 48 minutes",
        "Director": "Taika Waititi",
        "Cast": "Roman Griffin Davis, Thomasin Harcourt McKenzie, Taika Waititi, Scarlett Johansson, Sam Rockwell, Rebel Wilson, Stephen Merchant, Alfie Allen",
        "IMDB": 8,
        "Rate": 4,
        "Review": "Who would have thought director Taika Waititi of Thor: Ragnarok fame would make a black comedy set in Nazi Germany that would look like something of a cross between The Great Dictator and Life Is Beautiful? Not only has he directed it, but he has also acted in it as well, channelling his inner Chaplin to bring to life a slightly deranged Hitler. It's a film that would like you to believe that the German children weren't corrupted to their very core by the Nazi propaganda. That somehow they were able to retain their inner goodness. The film is set during the fag end of the Second World War, when Germany was losing. The people were no longer buying into the Nazi lies by then. Could the dynamics of the film have been different if it was set during the heady days when Hitler was winning everything? One couldn't be sure of that.Who would have thought director Taika Waititi of Thor: Ragnarok fame would make a black comedy set in Nazi Germany that would look like something of a cross between The Great Dictator and Life Is Beautiful? Not only has he directed it, but he has also acted in it as well, channelling his inner Chaplin to bring to life a slightly deranged Hitler. It's a film that would like you to believe that the German children weren't corrupted to their very core by the Nazi propaganda. That somehow they were able to retain their inner goodness. The film is set during the fag end of the Second World War, when Germany was losing. The people were no longer buying into the Nazi lies by then. Could the dynamics of the film have been different if it was set during the heady days when Hitler was winning everything? One couldn't be sure of that."
    },
    {
        "Movie Name": "Star Wars: The Rise of Skywalker",
        "Poster": "https://filmfare.wwmindia.com/content/2019/dec/star-wars-the-rise-of-skywalker-11576582532.jpg",
        "Genre": "Sci-fi, Drama",
        "Release Date": "19-Dec-19",
        "RunTime": "2 hours 22 minutes",
        "Director": "JJ Abrams",
        "Cast": "Carrie Fisher, Mark Hamill, Adam Driver, Daisy Ridley, John Boyega, Oscar Isaac, Anthony Daniels, Naomi Ackie, Domhnall Gleeson, Richard E. Grant, Lupita Nyong'o, Keri Russell, Joonas Suotamo, Kelly Marie Tran, Ian McDiarmid, Billy Dee Williams",
        "IMDB": 7,
        "Rate": 4,
        "Review": "The ninth film in the Star War series is both an end and a beginning. It answers some persistent questions asked by frustrated fans ever since the first film in the new trilogy -- Star Wars: The Force Awakens (2015) came about. It lays bare some mysteries and gives birth to some more. It might feel like the best Star Wars film of the modern era to some and for others, present reviewer included, it might prove to be an underwhelming experience overall.The ninth film in the Star War series is both an end and a beginning. It answers some persistent questions asked by frustrated fans ever since the first film in the new trilogy -- Star Wars: The Force Awakens (2015) came about. It lays bare some mysteries and gives birth to some more. It might feel like the best Star Wars film of the modern era to some and for others, present reviewer included, it might prove to be an underwhelming experience overall.The ninth film in the Star War series is both an end and a beginning. It answers some persistent questions asked by frustrated fans ever since the first film in the new trilogy -- Star Wars: The Force Awakens (2015) came about. It lays bare some mysteries and gives birth to some more. It might feel like the best Star Wars film of the modern era to some and for others, present reviewer included, it might prove to be an underwhelming experience overall."
    },
    {
        "Movie Name": "Jumanji: The Next Level",
        "Poster": "https://filmfare.wwmindia.com/content/2019/dec/jumanjithenextlevel11575886429.jpg",
        "Genre": "Comedy, Action",
        "Release Date": "10-Dec-19",
        "RunTime": "2 hours 3 minutes",
        "Director": "Jake Kasdan",
        "Cast": "Dwayne Johnson, Kevin Hart, Jack Black, Karen Gillan, Nick Jonas, Alex Wolff, Morgan Turner, Ser'Darius Blain, Madison Iseman, Awkwafina, Danny Glover, and Danny DeVito",
        "IMDB": 7.5,
        "Rate": 3,
        "Review": "Jumanji: The Next Level takes place a few years after the events depicted in Jumanji: Welcome To The Jungle (2017). Fridge (Ser'Darius Blain) is a college American football star, Bethany (Madison Iseman) is doing charity work building houses for the underprivileged, and Martha (Morgan Turner) is a popular student in her college. Spencer (Alex Wolff) is attending college in New York and working part-time in a supermarket. He has become even more insecure than before and it seems his long-distance relationship with Martha isn't working out. The four friends plan to meet in their hometown during the Christmas break and catch up. Frustrated by his insecurities, Spencer reboots the broken Jumanji game, which sucks him in. Now it's up to his four friends and also Spenser's grandfather Spencer's grandfather Eddie (Danny Devito) and his friend Milo (Danny Glover) to get in the game and rescue him.Jumanji: The Next Level takes place a few years after the events depicted in Jumanji: Welcome To The Jungle (2017). Fridge (Ser'Darius Blain) is a college American football star, Bethany (Madison Iseman) is doing charity work building houses for the underprivileged, and Martha (Morgan Turner) is a popular student in her college. Spencer (Alex Wolff) is attending college in New York and working part-time in a supermarket. He has become even more insecure than before and it seems his long-distance relationship with Martha isn't working out. The four friends plan to meet in their hometown during the Christmas break and catch up. Frustrated by his insecurities, Spencer reboots the broken Jumanji game, which sucks him in. Now it's up to his four friends and also Spenser's grandfather Spencer's grandfather Eddie (Danny Devito) and his friend Milo (Danny Glover) to get in the game and rescue him."
    },
    {
        "Movie Name": "Frozen II",
        "Poster": "https://filmfare.wwmindia.com/content/2019/nov/frozen-2-11574077026.jpg",
        "Genre": "Animation, Musical",
        "Release Date": "18-Nov-19",
        "RunTime": "1 hours 43 minutes",
        "Director": "Chris Buck, Jennifer Lee",
        "Cast": "Idina Menzel, Kristen Bell, Jonathan Groff, Josh Gad",
        "IMDB": 8,
        "Rate": 4,
        "Review": "The Empire Strikes Back, Terminator II -- there are very few examples where the sequel was said to be better than the original and now Frozen II joins those ranks. Six years have elapsed since Frozen’s release. Its protagonists, as well as its target audience, have both grown up. And hence the sequel is a more sedate, serene film than the earlier film. It doesn’t dwell much on the earlier storyline but takes the story to the ancestral history of sisters Anna (Kristen Bell) and Elsa (Idina Menzel). It tells us how the past is always connected to the present and the future. The film also takes us to a world beyond Arendelle, inhabited by fierce nature spirits, as well as giant rock trolls and flurry snowmen. And in this world-building that the film truly comes alive. The animation is better than the first film’s and the sight of an underground realm where the past gets enacted in the snow, or Elsa taming the horse-shaped water spirit and riding the waves is breathtaking. There is a sequence where water drops are drawn from a plank of wood which is a marvel indeed.The Empire Strikes Back, Terminator II -- there are very few examples where the sequel was said to be better than the original and now Frozen II joins those ranks. Six years have elapsed since Frozen’s release. Its protagonists, as well as its target audience, have both grown up. And hence the sequel is a more sedate, serene film than the earlier film. It doesn’t dwell much on the earlier storyline but takes the story to the ancestral history of sisters Anna (Kristen Bell) and Elsa (Idina Menzel). It tells us how the past is always connected to the present and the future. The film also takes us to a world beyond Arendelle, inhabited by fierce nature spirits, as well as giant rock trolls and flurry snowmen. And in this world-building that the film truly comes alive. The animation is better than the first film’s and the sight of an underground realm where the past gets enacted in the snow, or Elsa taming the horse-shaped water spirit and riding the waves is breathtaking. There is a sequence where water drops are drawn from a plank of wood which is a marvel indeed."
    },
    {
        "Movie Name": "Terminator: Dark Fate",
        "Poster": "https://filmfare.wwmindia.com/content/2019/oct/terminatordarkfate11572418770.jpg",
        "Genre": "Action, Sci-Fi",
        "Release Date": "30-Oct-19",
        "RunTime": "2 hours 8 minutes",
        "Director": "Tim Miller",
        "Cast": "Linda Hamilton, Arnold Schwarzenegger, Mackenzie Davis, Natalia Reyes, Gabriel Luna, Diego Boneta",
        "IMDB": 7.5,
        "Rate": 3,
        "Review": "Dani Ramos (Natalia Reyes), is a young woman working with her brother in a car factory in Mexico. Dani is skin Linda Hamilton’s Sarah Connor in the first Terminator. She must be protected at all costs because the future of humanity rests with her. The machines send a Terminator -- send a Terminator, the Rev-9 (Gabriel Luna), back in time to kill her while the Human Resistance sends an augmented soldier, Grace (Mackenzie Davis), to protect her. Her fate is also linked to Sarah Connor (Linda Hamilton), who has taken up killing terminators as a hobby. The three women must unite to survive the present as Rev-9 has never-seen-before powers. It can pop out its metal skeleton, and the two machines can work independently. It can also duplicate anyone's body just by touching them. They are helped in their quest by a retired T-800 Terminator (Arnold Schwarzenegger), who may have aged but still packs a punch.Dani Ramos (Natalia Reyes), is a young woman working with her brother in a car factory in Mexico. Dani is skin Linda Hamilton’s Sarah Connor in the first Terminator. She must be protected at all costs because the future of humanity rests with her. The machines send a Terminator -- send a Terminator, the Rev-9 (Gabriel Luna), back in time to kill her while the Human Resistance sends an augmented soldier, Grace (Mackenzie Davis), to protect her. Her fate is also linked to Sarah Connor (Linda Hamilton), who has taken up killing terminators as a hobby. The three women must unite to survive the present as Rev-9 has never-seen-before powers. It can pop out its metal skeleton, and the two machines can work independently. It can also duplicate anyone's body just by touching them. They are helped in their quest by a retired T-800 Terminator (Arnold Schwarzenegger), who may have aged but still packs a punch."
    },
    {
        "Movie Name": "Joker",
        "Poster": "https://filmfare.wwmindia.com/content/2019/sep/joker11569832393.jpg",
        "Genre": "Drama",
        "Release Date": "1-Oct-19",
        "RunTime": "2 hours 3 minutes",
        "Director": "Todd Phillips",
        "Cast": "Joaquin Phoenix, Robert De Niro, Zazie Beetz, Frances Conroy",
        "IMDB": 9,
        "Rate": 5,
        "Review": "Arthur Fleck (Joaquin Phoenix) isn’t happy with his life. He struggles to make money as a part-time clown while sharing a rundown apartment with his ailing mom (Frances Conroy). But Arthur lives in a city struck by hard times where a decent, honest living is difficult to come by. He also suffers from a condition that causes him to break into uncontrollable laughter. None of this stops Arthur from dreaming big. He aspires to be a stand-up comedian and attempts to write jokes in his diary. Caught in between it all, Arthur slowly begins to lose his grip on sanity.Arthur Fleck (Joaquin Phoenix) isn’t happy with his life. He struggles to make money as a part-time clown while sharing a rundown apartment with his ailing mom (Frances Conroy). But Arthur lives in a city struck by hard times where a decent, honest living is difficult to come by. He also suffers from a condition that causes him to break into uncontrollable laughter. None of this stops Arthur from dreaming big. He aspires to be a stand-up comedian and attempts to write jokes in his diary. Caught in between it all, Arthur slowly begins to lose his grip on sanity.\nIt’s immediately apparent that this is not your standard comic book fare. Todd Phillips painstakingly constructs the story of a man at his wit’s end when pushed beyond his breaking point. Phillips doesn’t glorify mental illness but instead makes a compelling case of a deeply disturbed individual struggling to find a coping mechanism in the form of an unhinged alter ego. This also resonates in his gritty vision of Gotham City, a metropolis brought to its knees, and crime is just a way of life. Only the rich and corrupt seem to be unaffected by the mayhem – a pertinent notion in present times. Set in the early 80's, this fictional city is reminiscent of that era with impeccable production and a time-relevant, yet unsettling soundtrack that evokes a constant sense of uneasiness."
    },
    {
        "Movie Name": "The Angry Birds 2",
        "Poster": "https://filmfare.wwmindia.com/content/2019/aug/theangrybirds2re1566461791.jpg",
        "Genre": "Animation",
        "Release Date": "21-Aug-19",
        "RunTime": "1 hours 36 minutes",
        "Director": "Thurop Van Orman",
        "Cast": "Jason Sudeikis, Josh Gad, Leslie Jones, Bill Hader, Rachel Bloom, Awkwafina, Sterling K. Brown, Eugenio Derbez, Danny McBride, Peter Dinklage",
        "IMDB": 8,
        "Rate": 4,
        "Review": "Three islands, lives at stake and a battle for survival - sounds like a pretty serious plot for an animated film, but this one’s far from it. Right from the first scene, it’s established that this sequel of ‘The Angry Birds’ is strictly a kiddie flick and thankfully, it never tries to be anything other than that. The makers throw in a lot of slapstick comedy by a battery of old and new characters of all shapes, sizes and colours. Leading the pack is the hot-headed Red (Jason Sudeikis), who has pretty much become symbolic of the franchise. To save the Bird Island, Red along with his winged buddies Chuck (Josh Gad) and Bomb (Danny McBride) must work with their ace nemesis, the king pig Leonard Mudbeard (Bill Hader). Together the trio are in a good form, bringing in a bulk of the laughs with their goofy acts. While Red’s character gets a definite arc, Chuck, Bomb and Leonard have to play on their special powers and unbridled cuteness, to impress the audience. Chuck’s a speed demon and Bomb can literally explode at a minute’s notice. Together, they are a force to reckon with, and the makers ensure that their special powers are exploited quite well without going overboard. Among the newbies, Chuck’s sister Silver (Rachel Bloom) – a tech-savvy Brainiac and the film’s main villain Zeta (Leslie Jones), a purple eagle are quite impressive. Zeta’s villainy is more entertaining than threatening, but that doesn’t blunt the terror she wields.\nThe film hits the ground running with the faceoff between the characters right from the beginning, but its tonality remains silly throughout. There are references from the real world like a film poster called ‘Crazy Rich Avians’, and ‘Piggific’ ocean. Jokes and punches of varying degrees come in consistently and abundantly. Many of them land successfully."
    },
    {
        "Movie Name": "Spider-Man: Far From Home",
        "Poster": "https://filmfare.wwmindia.com/content/2019/jul/spider-manfarfromhomere1562058701.jpg",
        "Genre": "Superhero, Fantasy",
        "Release Date": "1-Jul-19",
        "RunTime": "2 hours 36 minutes",
        "Director": "Jon Watts",
        "Cast": "Tom Holland, Samuel L. Jackson, Zendaya, Cobie Smulders, Jon Favreau, J. B. Smoove, Jacob Batalon, Martin Starr, Marisa Tomei, Jake Gyllenhaal",
        "IMDB": 8,
        "Rate": 4,
        "Review": "Peter Parker (Tom Holland) is still reeling after the massive showdown in ‘Avengers: Endgame’, which claimed the life of his mentor, Tony Stark. It’s only natural that he chooses to take a break from apocalyptic threats, and that comes in the form of an overseas school trip, along with his mates. Although, he’s a bonafide Avenger now, which means he has great responsibilities that he can’t escape, no matter where is. Peril soon catches up to him when Nick Fury (Samuel L. Jackson) shows up and gives him his next big mission. But is Peter up to the task?\nOne of the biggest tasks the film must tackle is picking up after the Marvel Cinematic Universe’s (MCU) world-altering ‘Endgame’. It does this by taking us into Peter's head, and the frame of mind Spider-Man is in. It makes a compelling angle; Peter is struggling with who he is – a school going teenager who really likes his classmate MJ (Zendaya), and who he is meant to become – Tony Stark’s successor. The plot is mostly built around this problem, and Tom Holland brings a lot of nuance and depth to both angles. Peter’s affable demeanour is now well-established, but Holland also makes this Spider-Man a more significant force to be reckoned with, and that’s saying something."
    },
    {
        "Movie Name": "Johnny English: Strikes Again",
        "Poster": "https://filmfare.wwmindia.com/content/2018/sep/re1537793301.jpg",
        "Genre": "Comedy",
        "Release Date": "28-Sep-18",
        "RunTime": "1 hours 29 minutes",
        "Director": "David Kerr",
        "Cast": "Rowan Atkinson, Ben Miller, Olga Kurylenko, Jake Lacy, Emma Thompson",
        "IMDB": 6.5,
        "Rate": 3,
        "Review": "Rowan Atkinson is the brightest star of the British humour. Blackadder, Mr Bean and numerous other characters he has made his own over the years are a testimony to his versatility, not to mention his popularity. He's so good that he actually doesn't need a script. And the makers were counting on that perhaps when they signed him on to play Johnny English yet again. Playing a clumsy secret service agent, a nod perhaps to Peter Sellers’ bumbling Inspector Clouseau from the Pink Panther series of films, comes easy to Atkinson. He can do it in his sleep. But this over-dependence on the actor has made the writers and the director lazy. The plot lines have become so predictable that you can spot the twists a mile off. And that kind of jars.Rowan Atkinson is the brightest star of the British humour. Blackadder, Mr Bean and numerous other characters he has made his own over the years are a testimony to his versatility, not to mention his popularity. He's so good that he actually doesn't need a script. And the makers were counting on that perhaps when they signed him on to play Johnny English yet again. Playing a clumsy secret service agent, a nod perhaps to Peter Sellers’ bumbling Inspector Clouseau from the Pink Panther series of films, comes easy to Atkinson. He can do it in his sleep. But this over-dependence on the actor has made the writers and the director lazy. The plot lines have become so predictable that you can spot the twists a mile off. And that kind of jars."
    },
    {
        "Movie Name": "Men In Black IV",
        "Poster": "https://filmfare.wwmindia.com/content/2019/jun/men-in-black-re1560257332.jpg",
        "Genre": "Action",
        "Release Date": "29-Sep-18",
        "RunTime": "1 hours 55 minutes",
        "Director": "F. Gary Gray",
        "Cast": "Chris Hemsworth, Tessa Thompson, Rebecca Ferguson, Kumail Nanjiani, Rafe Spall, Laurent and Larry Bourgeois, Liam Neeson, Emma Thompson",
        "IMDB": 7,
        "Rate": 3,
        "Review": "As a kid Molly (Tessa Thompson) helps a little alien escape the clutches of MIB agents. The memory of her parents regarding the incident gets wiped out but somehow she escapes that fate and remembers everything. As an adult, it's her mission to find the agency and be a part of it. She eventually achieves that, much to the happiness of Agent O (Emma Thompson), the head of MIB's US branch. She's sent on a mission to Britain, where she teams up with the best British agent, Agent H (Chris Hemsworth), a rakish agent modelled on James Bond. They must now work together to make sure a weapon which can destroy worlds doesn't fall into the hands of the bad guys..."
    },
    {
        "Movie Name": "The Lion King",
        "Poster": "https://filmfare.wwmindia.com/content/2019/jul/lion-king-poster156322744515632274911563227509156322752715632275511563227601.jpg",
        "Genre": "Musical, Animation, Fantasy",
        "Release Date": "15-Jul-19",
        "RunTime": "1 hours 58 minutes",
        "Director": "Jon Favreau",
        "Cast": "Donald Glover, Seth Rogen, Chiwetel Ejiofor, Alfre Woodard, Billy Eichner, John Kani, John Oliver, Beyoncé Knowles-Carter, James Earl Jones",
        "IMDB": 8,
        "Rate": 4,
        "Review": "To say this live-action film is a computer-animated remake of 1994’s animated classic doesn’t quite justify its visual impact. The technical advancement in computer animation is on full display here, and it’s genuinely staggering to experience. There are moments when you will wonder if you're watching a wildlife documentary, albeit with one big difference. It’s all scripted with a story you’re familiar with, especially if you’ve watched the 1994 version. So, you already know how this all plays out, and there are virtually no surprises at all. The performances feel somewhat restricted by the realistic portrayal of animals in this version, as it leaves very little room to emote besides the voice work.\nThis is where things get really tricky, despite having an immensely talented voice cast. Both Donald Glover and Beyoncé Knowles have the singing credentials, and while Glover adds some charisma to Simba, Nala doesn’t get much to speak of. Still, their relationship is charming in parts. Chiwetel Ejiofor certainly does more to make Scar menacing, and perhaps just enough to remember him as a formidable villain. The most enjoyable characters are Pumbaa and Timon, voiced by Seth Rogen and Billy Eichner respectively. They lighten up the proceedings and bring some much-needed personality with the adorable warthog and meerkat combination. A spin-off featuring Simba, Pumbaa and Timon would be well-received and arguably far more entertaining. As he did in the original, James Earl Jones plays Mufasa once again to bring home the nostalgic factor."
    },
    {
        "Movie Name": "Captain Marvel",
        "Poster": "https://filmfare.wwmindia.com/content/2019/mar/captainmarvelreview1551770030.jpg",
        "Genre": "Superhero, action, drama",
        "Release Date": "5-Mar-19",
        "RunTime": "2 hours 4 minutes",
        "Director": "Anna Boden, Ryan Fleck",
        "Cast": "Brie Larson, Samuel L. Jackson, Ben Mendelsohn, Djimon Hounsou, Lee Pace, Lashana Lynch, Gemma Chan, Annette Bening, Clark Gregg, Jude Law",
        "IMDB": 7.5,
        "Rate": 3,
        "Review": "The first female-led superhero film in the Marvel Cinematic Universe (MCU) has been a long time coming. Despite other strong female superheroes who have arguably earned their standalone film (Black Widow, Scarlet Witch, Valkyrie), the MCU's focus on the build-up to 'Avengers: Endgame' has reached a fever pitch. So, it only makes sense to introduce Carol Danvers (Brie Larson), or Captain Marvel as a vital piece in the puzzle. When we first meet Danvers, she is a powerful soldier of an alien race known as the Kree. Even though she feels a strong connection to Earth, she is unaware of her identity. During an intergalactic battle, she crashes on Earth, known as C-53, where she encounters Agent Nick Fury (Samuel L. Jackson). She then begins to retrace her memories to her origins.\nBrie Larson is convincing enough as Carol Danvers. She isn’t as brooding as the trailers make her out to be; in fact, Danvers shares some of the lighter moments with a pre-eye-patch Nick Fury. Samuel L. Jackson seems to enjoy playing a relatively naïve version of the otherwise surly Fury who quickly learns that everything is not as it seems. Jude Law's addition to the MCU isn't exactly memorable, but Ben Mendelsohn particularly stands out. The 90’s tonality, complete with a grunge-era soundtrack is a good look for the MCU, and it lends ample opportunities for humour. Although the script aims at big laughs, it doesn’t always succeed. In fact, real guffaws come from unexpected places. Hint: cat-lovers will be thoroughly delighted with Goose, who arguably turns out to be a real scene-stealer."
    },
    {
        "Movie Name": "Toy Story 4",
        "Poster": "https://filmfare.wwmindia.com/content/2019/jun/toystory4re1560944047.jpg",
        "Genre": "Animation, Comedy",
        "Release Date": "20-Jun-19",
        "RunTime": "1 hours 40 minutes",
        "Director": "Josh Cooley",
        "Cast": "Tom Hanks, Tim Allen, Annie Potts, Tony Hale, Keegan-Michael Key, Jordan Peele",
        "IMDB": 8.0,
        "Rate": 4,
        "Review": "Hollywood has a distinct ability to breathe life into objects and the Toy Story franchise is perhaps the best example. This time, writers Andrew Stanton and Stephany Folsom introduce some new characters in this emotional roller coaster. While we still have the good ol’ Woody holding the center stage, the focus is now on Forky. As the name suggests, it’s just a fork with strings for hands and broken wooden sticks for toes. But the fact that you feel instantly connected with him and root for him symbolises the brilliance of the film’s nuanced writing and near flawless execution. Tony Hale’s perfectly pitched voice and an endearing character arc gives him the edge. Director Josh Cooley promptly pulls Toy Story 4 into the action mode as the motley group of toys are taken on a road trip. The fun adventure begins right from the start, as we see Woody inadvertently getting in trouble for always doing the right thing. And Tom Hanks’ reassuring voice is so well suited to Woody that he never feels like a toy. Of course, the other superstar toys from the Toy Story hall of fame continue to shine here too. Among them, Buzz Lightyear (Tim Allen) and Bo Peep (Annie Potts) get a lot more to play with, compared to the rest of the gang. Watch out for Bo’s character transition from a porcelain skinned beauty to a street-smart survivor. Buzz on the other hand, continues to charm as a supportive friend, who is always ready to take one for the team. While the other characters (like Potato Heads, Jessie, Bullseye, Hamm and Rex) are mostly relegated to the background, many laugh out loud moments come from the adorable newcomers Ducky (Keegan-Michael Key) and Bunny (Jordan Peele). More newcomers like the Canadian biker stuntman Duke Caboom (Keanu Reeves) and the doll named Gabby Gabby {Christina Hendricks) add a whole new twist to the tale. While Gabby’s character develops in an intriguing manner, Caboom adds to the action adventure despite an equally poignant past. But the hero of the film is clearly Woody, who always plays it right and tugs at your heartstrings.\nWhat really makes Toy Story 4 special is its strong emotional fabric woven into a riveting narrative. Dialogues are laced with high emotional impact and are delivered effectively in familiar voices. This brilliantly captures the film’s core mission to humanise the bond between a child and a toy. Overall, this instalment of Toy Story succeeds in achieving a lot more than just laughs. It manages to strike a universal chord with its audience, by posing deep and meaningful questions like the purpose of our existence. And it does all of this in a wholesome entertaining way with enough comedy and action to make it a fun ride for children of all ages."
    }
]